app/helpers/application_helper.rb

  def player(player_id)
    Player.find(player_id)
---
SELECT "players".* FROM "players" WHERE "players"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]