app/controllers/players_controller.rb

SELECT "players".* FROM "players" ORDER BY "players"."sex" DESC, "players"."position" ASC, "players"."commitment" DESC, "players"."name" ASC
---
  def index
    @players = Player.all.order(sex: :desc, commitment: :asc, position: :asc, name: :asc)